/*
1. 등록함수
    - input value값 받기
    - .push로 배열 추가
    - 출력함수 호출
2. 출력함수
    - 시작시 출력
    - for문 배열 순회
    - html로 `` 출력
    (- 유효성검사 )

    
3. 수정함수
    - alert(prompt) 로 값 받기(3개)
    - 출력함수
4. 삭제함수
    - splice
    - 배열 내 객체 삭제

재고 등록함수시 매개변수 사용

 */


let 독서 = [
    { 도서코드 : 1 , 도서명 : "비행운" , 출판사 : "민음사" , 위치 : 1 },
    { 도서코드 : 2 , 도서명 : "천사와 악마" , 출판사 : "문학수첩" , 위치 : 2 },
    { 도서코드 : 3 , 도서명 : "종이여자" , 출판사 : "문학비행" , 위치 : 3 }
]
let 재고 = [
    { 도서코드 : 1 , 재고량 : 250 , 정가 : 6500 , 입고날짜 : "2024-12-4" },
    { 도서코드 : 2 , 재고량 : 100 , 정가 : 16500 , 입고날짜 : "2024-12-5" },
    { 도서코드 : 3 , 재고량 : 50 , 정가 : 15000 , 입고날짜 : "2024-12-6" }
]


