let 지역 = [
    { 지역번호 : 1 , 지역명 : "서울" }, 
    { 지역번호 : 2 , 지역명 : "경기/인천" }, 
    { 지역번호 : 3 , 지역명 : "충청/대전" }
]

let 지점 = [
    { 지점번호 : 1 , 지점명 : "가산디지털" , 지역번호 : 1},
    { 지점번호 : 2 , 지점명 : "가양" , 지역번호 : 1},
    { 지점번호 : 3 , 지점명 : "강동" , 지역번호 : 1},
    { 지점번호 : 4 , 지점명 : "건대입구" , 지역번호 : 1},
    { 지점번호 : 5 , 지점명 : "광교" , 지역번호 : 2},
    { 지점번호 : 6 , 지점명 : "광명(광명사거리)" , 지역번호 : 2},
    { 지점번호 : 7 , 지점명 : "광명아울렛" , 지역번호 : 2},
    { 지점번호 : 8 , 지점명 : "광주터미널" , 지역번호 : 2},
    { 지점번호 : 9 , 지점명 : "당진" , 지역번호 : 3},
    { 지점번호 : 10 , 지점명 : "대전(백화점)" , 지역번호 : 3},
]

let 영화정보 = [
    { 영화명 : "위키드" , 지점번호 }
]
